# coding: utf-8
# author: QCL
# software: PyCharm Professional Edition 2018.2.8

# monogodb数据库相关信息配置
MONGODB_HOST = "localhost"
MONGODB_PORT = 27017

# 用来存储豆瓣电影的mongo数据库
MONGO_DB = "dou_ban"

# 用来存储腾讯招聘岗位的mongo数据库
MONGO_TENCENT_DB = "tenCentCareer"


# mysql数据库相关配置
MYSQL_HOST = "localhost"
MYSQL_PORT = 3306
MYSQL_USER = "root"
MYSQL_PASSWORD = ""
MYSQL_DATABASE = "python_spider"

# 电影分类排行榜剧情与类型映射
CLASSIFICATION_MAPPING = {
    "01_剧情": {
        "剧情": "11"
    },
    "02_喜剧": {
        "喜剧": "24"
    },
    "03_动作": {
        "动作": "5"
    },
    "04_爱情": {
        "爱情": "13"
    },
    "05_科幻": {
        "科幻": "17"
    },
    "06_动画": {
        "动画": "25"
    },
    "07_悬疑": {
        "悬疑": "10"
    },
    "08_惊悚": {
        "惊悚": "19"
    },
    "09_恐怖": {
        "恐怖": "20"
    },
    "10_纪录片": {
        "纪录片": "1"
    },
    "11_短片": {
        "短片": "23"
    },
    "12_情色": {
        "情色": "6"
    },
    "13_同性": {
        "同性": "26"
    },
    "14_音乐": {
        "音乐": "14"
    },
    "15_歌舞": {
        "歌舞": "7"
    },
    "16_家庭": {
        "家庭": "28"
    },
    "17_儿童": {
        "儿童": "8"
    },
    "18_传记": {
        "传记": "2"
    },
    "19_历史": {
        "历史": "4"
    },
    "20_战争": {
        "战争": "22"
    },
    "21_犯罪": {
        "犯罪": "3"
    },
    "22_西部": {
        "西部": "27"
    },
    "23_奇幻": {
        "奇幻": "16"
    },
    "24_冒险": {
        "冒险": "15"
    },
    "25_灾难": {
        "灾难": "12"
    },
    "26_武侠": {
        "武侠": "29"
    },
    "27_古装": {
        "古装": "30"
    },
    "28_运动": {
        "运动": "18"
    },
    "29_黑色电影": {
        "黑色电影": "31"
    }
}

